<a href="https://colab.research.google.com/github/superherobtf1985/pandas1/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandasの基本1

In [0]:
import pandas as pd

## Series型

In [0]:
s = pd.Series(["New York", "Tokyo", "Paris", "London"])

## DataFrame型

In [0]:
df = pd.DataFrame({
       "city": ["New York", "Tokyo", "Paris", "London"],
       "country": ["USA", "Japan", "France", "UK"],
       "city_population": [8623000, 9273000, 2141000, 8136000],
       "country_population": [327200000, 126800000, 66990000, 66040000]
})

1つの列を取り出すとSeries型になっていることが確認できる

In [5]:
type(df["country"])

pandas.core.series.Series

新たなカラムを追加することもできる

In [6]:
df["country_GDP"] = [20494050000000, 4971929000000, 2828644000000, 2775252000000]
df

       city country  city_population  country_population     country_GDP
0  New York     USA          8623000           327200000  20494050000000
1     Tokyo   Japan          9273000           126800000   4971929000000
2     Paris  France          2141000            66990000   2828644000000
3    London      UK          8136000            66040000   2775252000000

## 理解度チェック

In [8]:
school_df = pd.read_csv("school.csv")
school_df

      name  age     sex    nationality  height
0     Jack    7    male        England     130
1     John   10    male  United States     139
2    Alice   12  female        England     148
3      Bob    7    male      Australia     127
4  Dominic    8    male        Germany     131
5    Akiko   11  female          Japan     142
6    Carly    6  female         Canada     121

ageの平均値を出す（describe）

In [9]:
school_df["age"].describe()

count     7.000000
mean      8.714286
std       2.288689
min       6.000000
25%       7.000000
50%       8.000000
75%      10.500000
max      12.000000
Name: age, dtype: float64

カラムを追加してファイル出力する

In [0]:
school_df["weight"] = [29, 31, 33, 28, 29, 31, 27]
school_df.to_csv("school_add_weight.csv")